[

  { 
    "id": "ht55hd42",
    "chefName": "Gino D'Acampo",
    "chefPictureUrl": "https://i.ibb.co/jvptqV1/cheff1.jpg",
    "Years_of_experience": "10 years",
    "Numbers_of_recipes": 3,
    "likes": 17059,
    "Ratings": 5,
    "description": "Gino D'Acampo is an Italian celebrity chef, television personality, and author. He was born on July 17, 1976, in Torre del Greco, near Naples, Italy.Gino's culinary career began at the age of 19 when he moved to London and started working in the kitchens of several restaurants. He later opened his own restaurant, 'Bontà Italia,' which was a success.Gino became well-known in the UK for his appearances on the television show 'Ready Steady Cook,' and has since appeared on numerous other cooking shows including 'This Morning,' 'Saturday Kitch'and 'Celebrity Juice.' He has also written several best-selling cookbooks, including 'Gino's Pasta,' 'Gino's Italian Escape,' and 'Gino's Hidden Italy.'In addition to his culinary work, Gino has also appeared as a contestant on the reality TV show 'I'm a Celebrity...Get Me Out of Here!' and has hosted his own travel shows, exploring the food and culture of Italy.Gino is known for his charismatic personality, passion for Italian cuisine, and commitment to using fresh, seasonal ingredients in his cooking. He currently resides in Hertfordshire, England, with his wife and three children.",
    "recipes": [
      {
        "name": "Spaghetti Carbonara",
        "img": "https://i.ibb.co/zRDpGMf/Spaghetti-Carbonara-jpeg.jpg",
        "ingredients": [
          "400g spaghetti",
          "150g pancetta, diced",
          "3 large eggs",
          "50g Pecorino Romano cheese, grated",
          "50g Parmesan cheese, grated",
          "1 garlic clove, finely chopped",
          "Salt and freshly ground black pepper"
        ],
        "cooking_method":
            "Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente, according to package instructions. While the spaghetti is cooking, heat a large frying pan over medium heat. Add the diced pancetta and cook until crispy and golden brown, stirring occasionally, for about 5-7 minutes.Add the finely chopped garlic to the frying pan with the pancetta and cook for an additional 1-2 minutes until fragrant. Remove the pan from the heat.In a bowl, lightly beat the eggs and add the grated Pecorino Romano cheese and Parmesan cheese. Season with salt and freshly ground black pepper.Drain the spaghetti and reserve 1/2 cup of the pasta cooking water.Add the drained spaghetti to the frying pan with the pancetta and garlic. Toss well to combine. Pour the egg and cheese mixture over the spaghetti and toss well until the spaghetti is coated evenly.If the sauce is too thick, gradually add some of the reserved pasta cooking water until the desired consistency is achieved."
      },
      {
        "name": "Pizza Margherita",
        "img": "https://i.ibb.co/Vwkjv9x/Pizza-Margherita.jpg",
        "ingredients": [
          "500g strong bread flour",
          "1 tsp instant yeast",
          "1 tsp salt",
          "1 tbsp olive oil",
          "300ml warm water",
          "1 x 400g can chopped tomatoes",
          "1 garlic clove, crushed",
          "1 tbsp tomato puree",
          "1 tsp dried oregano",
          "125g mozzarella cheese, sliced",
          "A handful of fresh basil leaves"
        ],
        "cooking_method": "Preheat your oven to 450°F (230°C). If you have a pizza stone, place it in the oven to heat up.Dust a clean work surface with flour and roll out the pizza dough to a thickness of about 1/4 inch (0.6 cm).Transfer the pizza dough to a piece of parchment paper.Spread the tomato sauce over the pizza dough, leaving a small border around the edges.Arrange the mozzarella cheese slices over the tomato sauce.Drizzle the olive oil over the pizza and season with salt and freshly ground black pepper.Slide the pizza onto the preheated pizza stone or onto a baking sheetBake for 10-12 minutes or until the pizza crust is golden brown and crispy.Remove the pizza from the oven and let it cool for a minute or two."
      },
      {
        "name": "Tiramisu",
        "img": "https://i.ibb.co/x5xjJm1/Tiramisu.jpg",
        "ingredients": [
          "3 large eggs, separated",
          "75g caster sugar",
          "250g mascarpone cheese",
          "100ml strong espresso coffee",
          "50ml Amaretto liqueur",
          "175g Savoiardi biscuits (ladyfingers)",
          "Cocoa powder, for dusting"
        ],
        "cooking_method": "In a large bowl, beat the egg yolks and sugar together with an electric mixer until light and creamy. In a medium saucepan, heat the milk over low heat until just simmering. Gradually pour the hot milk into the egg mixture, whisking constantly.Pour the mixture back into the saucepan and cook over low heat, stirring constantly, until the mixture thickens and coats the back of a spoon. Be careful not to let it boil or the eggs will scramble.Remove the saucepan from the heat and let it cool to room temperature.In a separate bowl, beat the heavy cream and vanilla extract together until stiff peaks form.In a large mixing bowl, beat the mascarpone cheese until smooth and creamy.Add the cooled custard mixture to the mascarpone cheese and mix until well combined.In a small bowl, mix together the espresso and rum.Dip each ladyfinger briefly into the espresso mixture, making sure not to soak them for too long or they will become too soggy."
      }
    ]
  },

  {
    "id": "gt71s3",
    "chefName": "Antonio Carluccio",
    "chefPictureUrl": "https://i.ibb.co/k50mHDz/cheff2.jpg",
    "Years_of_experience": "8 years",
    "Numbers_of_recipes": 3,
    "likes": 12014,
    "Ratings": 5,
    "description": "Antonio Carluccio was an Italian chef, restaurateur, and television personality who was born on April 19, 1937, in Vietri sul Mare, Italy. He was known as 'the godfather of Italian gastronomy' and was a prominent figure in the UK's culinary scene for several decades.Carluccio's career began in the 1960s when he moved to London and began working as a wine merchant. He later transitioned to the food industry and worked as a chef at several prestigious restaurants in London, including Neal Street Restaurant, where he met his future business partner, Priscilla Conran.In 1981, Carluccio and Conran opened their first restaurant together, 'Neal Street Restaurant,' which was a huge success. They later founded the 'Carluccio's' chain of Italian restaurants, which became a staple of the UK's high street.Carluccio was also a prolific author and wrote over 20 cookbooks, many of which focused on traditional Italian cuisine. He was a regular on television shows such as 'Antonio Carluccio's Italian Feast' and 'Two Greedy Italians' alongside Gennaro Contaldo.Throughout his career, Carluccio was a passionate advocate for simple, fresh, and authentic Italian cuisine. He was awarded an OBE in 2007 for his services to the catering industry and was also appointed as the Commendatore dell'Ordine della Stella d'Italia (Commander of the Order of the Star of Italy) by the Italian government in recognition of his contributions to the promotion of Italian cuisine.Sadly, Carluccio passed away on November 8, 2017, at the age of 80, leaving behind a legacy as one of the most influential figures in the UK's culinary scene.",
    "recipes": [
        {
          "name": "Pesto alla Genovese",
          "img": "https://i.ibb.co/CJHksBx/Pesto-alla-Genovese.jpg",
          "ingredients": [
            "50g fresh basil leaves",
            "1 garlic clove, peeled",
            "50g pine nuts",
            "50g Pecorino Romano cheese, grated",
            "50g Parmesan cheese, grated",
            "100ml extra virgin olive oil",
            "Salt and freshly ground black pepper"
          ],
          "cooking_method" : "Cook the pasta in a large pot of boiling salted water until al dente, following the package instructions.While the pasta cooks, heat the olive oil and butter in a large skillet over medium-low heat.Add the sliced onions and cook, stirring occasionally, until they are very soft and golden brown, about 40-50 minutes. Add a little bit of water if the onions begin to stick to the bottom of the skillet.Once the onions are caramelized, season them with salt and pepper to taste.Reserve about 1 cup of the pasta cooking water, then drain the pasta and return it to the pot.Add the caramelized onions and the Parmesan cheese to the pot with the pasta and toss everything together, adding some of the reserved pasta cooking water as needed to create a creamy sauce.Serve hot, topped with additional Parmesan cheese and black pepper if desired."
        },
        {
          "name": "Risotto ai Funghi",
          "img": "https://i.ibb.co/HB1mM5D/Risotto-ai-Funghi.jpg",
          "ingredients": [
            "300g Arborio rice",
            "1 litre vegetable stock",
            "50g unsalted butter",
            "1 onion, finely chopped",
            "2 garlic cloves, finely chopped",
            "500g mixed mushrooms, sliced",
            "100g Parmesan cheese, grated",
            "A handful of fresh parsley, chopped",
            "Salt and freshly ground black pepper"
          ],
          "cooking_method" : "In a large saucepan, heat the chicken or vegetable broth over low heat and keep it warm.In a separate large saucepan or Dutch oven, heat the olive oil over medium heat.Add the onions and garlic to the saucepan and cook, stirring occasionally, until they are softened, about 5-7 minutes.Add the sliced mushrooms to the saucepan and continue cooking until the mushrooms are tender and lightly browned, about 8-10 minutes.Add the Arborio rice to the saucepan and stir to coat it in the oil and vegetable mixture.Pour in the white wine and let it simmer until the liquid has been absorbed by the rice, stirring occasionally.Begin adding the warm broth to the saucepan, about 1/2 cup at a time, stirring frequently and allowing each addition to be absorbed before adding more. Continue this process until the rice is tender but still has a slight bite, about 20-25 minutes.Remove the saucepan from the heat and stir in the grated Parmesan cheese and butter until they are fully melted and incorporated."
        },
        {
          "name": "Torta di Mele",
          "img": "https://i.ibb.co/3kbkpCh/Torta-di-Mele.jpg",
          "ingredients": [
            "4 apples, peeled and sliced",
            "150g caster sugar",
            "3 eggs",
            "150g plain flour",
            "50g unsalted butter, melted",
            "100ml whole milk",
            "1 tsp baking powder",
            "1 tsp vanilla extract",
            "A pinch of salt",
            "Icing sugar, for dusting"
          ],
          "cooking_method" : "Preheat the oven to 350°F. Grease a 9-inch springform pan and set aside.In a large bowl, beat the butter and sugar together until light and fluffy, about 2-3 minutes.Add the eggs, one at a time, beating well after each addition.In a separate bowl, whisk together the all-purpose flour, almond flour, baking powder, and salt.Gradually add the dry ingredients to the wet ingredients, alternating with the milk, and beat until just combined.Pour the batter into the prepared springform pan and smooth the top with a spatula.Arrange the sliced apples on top of the batter, pressing them down slightly.Bake the cake for 40-50 minutes or until a toothpick inserted into the center of the cake comes out clean.Allow the cake to cool in the pan for 10-15 minutes before removing it from the pan and placing it on a wire rack to cool completely."
        }
      ]
  },

  {
    "id": "fdg5y7",
    "chefName": "Massimo Bottura",
    "chefPictureUrl": "https://i.ibb.co/wQF9NDB/cheff3.jpg",
    "Years_of_experience": "5 years",
    "Numbers_of_recipes": 3,
    "likes": 13852,
    "Ratings": 4.9,
    "description": "Massimo Bottura is an Italian chef and restaurateur who is widely regarded as one of the most influential chefs in the world. He was born on September 30, 1962, in Modena, Italy.Bottura's culinary career began in the 1980s when he worked at several Michelin-starred restaurants in France. In 1995, he and his wife, Lara Gilmore, opened their own restaurant, 'Osteria Francescana,' in Modena. The restaurant quickly gained critical acclaim for its innovative and contemporary take on traditional Italian cuisine.Over the years, Bottura has become known for his commitment to using locally sourced and seasonal ingredients in his cooking, as well as his dedication to reducing food waste. He is also an advocate for social and environmental issues and has used his platform to promote sustainability and support charitable causes.Bottura has received numerous awards and accolades for his work, including three Michelin stars for Osteria Francescana, which has consistently been ranked among the best restaurants in the world. In 2016, he launched 'Food for Soul,' a non-profit organization that aims to fight food waste and social isolation by transforming surplus ingredients into nutritious meals for those in need.Bottura is also the author of several cookbooks, including 'Never Trust a Skinny Italian Chef' and 'Bread is Gold,' which features recipes from some of the world's top chefs using ingredients that would otherwise be thrown away.In addition to his culinary work, Bottura is a frequent speaker at conferences and events around the world, where he shares his vision for the future of food and inspires others to make a positive impact on the world.",
    "recipes": [
        {
            "name": "Tortellini in Brodo",
            "img": "https://i.ibb.co/wR5CNNd/Tortellini-in-Brodo.jpg",
            "ingredients": [
                "1 package (8-10 oz.) of fresh or frozen tortellini",
                "8 cups of chicken or vegetable broth",
                "2 cloves of garlic, minced",
                "2 tbsp. of olive oil",
                "1/2 cup of grated Parmesan cheese",
                "Salt and pepper to taste",
                "Fresh parsley, chopped (optional)"
            ],
            "cooking_method" : "In a large pot, heat the olive oil over medium heat. Add the minced garlic and sauté for about 30 seconds until fragrant.Add the chicken or vegetable broth to the pot and bring it to a boil.Once the broth has come to a boil, reduce the heat to low and let it simmer.Cook the tortellini in a separate pot of boiling salted water according to package instructions, usually for about 3-4 minutes for fresh tortellini or 8-10 minutes for frozen tortellini.Once the tortellini is cooked, drain it and add it to the pot of simmering broth.Let the tortellini cook in the broth for 1-2 minutes, until heated through.Season the soup with salt and pepper to taste.Serve the Tortellini in Brodo hot, garnished with grated Parmesan cheese and chopped parsley if desired. "
        },
        {
            "name": "Spaghetti Carbonara",
            "img": "https://i.ibb.co/zRDpGMf/Spaghetti-Carbonara-jpeg.jpg",
            "ingredients": [
              "400g spaghetti",
              "150g pancetta, diced",
              "3 large eggs",
              "50g Pecorino Romano cheese, grated",
              "50g Parmesan cheese, grated",
              "1 garlic clove, finely chopped",
              "Salt and freshly ground black pepper"
            ],
            "cooking_method":
                "Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente, according to package instructions. While the spaghetti is cooking, heat a large frying pan over medium heat. Add the diced pancetta and cook until crispy and golden brown, stirring occasionally, for about 5-7 minutes.Add the finely chopped garlic to the frying pan with the pancetta and cook for an additional 1-2 minutes until fragrant. Remove the pan from the heat.In a bowl, lightly beat the eggs and add the grated Pecorino Romano cheese and Parmesan cheese. Season with salt and freshly ground black pepper.Drain the spaghetti and reserve 1/2 cup of the pasta cooking water.Add the drained spaghetti to the frying pan with the pancetta and garlic. Toss well to combine. Pour the egg and cheese mixture over the spaghetti and toss well until the spaghetti is coated evenly.If the sauce is too thick, gradually add some of the reserved pasta cooking water until the desired consistency is achieved."
        },
        {
          "name": "Tiramisu",
          "img": "https://i.ibb.co/x5xjJm1/Tiramisu.jpg",
          "ingredients": [
            "3 large eggs, separated",
            "75g caster sugar",
            "250g mascarpone cheese",
            "100ml strong espresso coffee",
            "50ml Amaretto liqueur",
            "175g Savoiardi biscuits (ladyfingers)",
            "Cocoa powder, for dusting"
          ],
          "cooking_method": "In a large bowl, beat the egg yolks and sugar together with an electric mixer until light and creamy. In a medium saucepan, heat the milk over low heat until just simmering. Gradually pour the hot milk into the egg mixture, whisking constantly.Pour the mixture back into the saucepan and cook over low heat, stirring constantly, until the mixture thickens and coats the back of a spoon. Be careful not to let it boil or the eggs will scramble.Remove the saucepan from the heat and let it cool to room temperature.In a separate bowl, beat the heavy cream and vanilla extract together until stiff peaks form.In a large mixing bowl, beat the mascarpone cheese until smooth and creamy.Add the cooled custard mixture to the mascarpone cheese and mix until well combined.In a small bowl, mix together the espresso and rum.Dip each ladyfinger briefly into the espresso mixture, making sure not to soak them for too long or they will become too soggy."
        }
    ]
  },

  {
    "id": "89hfn4",
    "chefName": "Giada De Laurentiis",
    "chefPictureUrl": "https://i.ibb.co/FB6MpcH/cheff4.jpg",
    "Years_of_experience": "11 years",
    "Numbers_of_recipes": 3,
    "likes": 20079,
    "Ratings": 4.8,
    "description": "Giada De Laurentiis is an Italian-American chef, author, and television personality who was born on August 22, 1970, in Rome, Italy. She is known for her Italian-American cuisine and her appearances on Food Network shows.De Laurentiis' culinary career began when she worked at her family's restaurant in California. She later attended Le Cordon Bleu culinary school in Paris and worked in several restaurants in Los Angeles before launching her own catering company.In 2002, De Laurentiis began hosting her first show on Food Network, 'Everyday Italian,' which focused on simple and traditional Italian cuisine. She has since hosted several other cooking shows, including 'Giada at Home,' 'Giada's Weekend Getaways,' and 'Giada in Italy.'In addition to her television work, De Laurentiis has authored several cookbooks, including 'Everyday Italian,' 'Giada's Family Dinners,' and 'Giada's Italy,' which feature recipes inspired by her Italian heritage.De Laurentiis has been recognized for her contributions to the culinary world, including a Daytime Emmy Award for 'Outstanding Lifestyle Host' and induction into the Culinary Hall of Fame. She is also involved in charitable organizations, including the Children's Cancer Association and Stand Up to Cancer",
    "recipes": [
        {
            "name": "Tortellini in Brodo",
            "img": "https://i.ibb.co/wR5CNNd/Tortellini-in-Brodo.jpg",
            "ingredients": [
                "2 cups of heavy cream",
                "1/2 cup of whole milk",
                "1/2 cup of granulated sugar",
                "1 tsp. of vanilla extract",
                "2 1/2 tsp. of powdered gelatin",
                "Fresh berries or fruit, for topping (optional)"
            ],
            "cooking_method": "In a medium-sized saucepan, combine the heavy cream, whole milk, and granulated sugar.Heat the mixture over medium heat, stirring occasionally, until the sugar has completely dissolved.Add the vanilla extract to the saucepan and stir to combine.In a small bowl, sprinkle the powdered gelatin over 3 tablespoons of cold water and let it sit for 5 minutes until it has softened.Once the gelatin has softened, add it to the saucepan with the cream mixture and stir to combine.Heat the mixture over low heat, stirring constantly, until the gelatin has completely dissolved and the mixture is smooth.Remove the saucepan from the heat and let it cool for 5-10 minutes.Pour the mixture into 4-6 ramekins or glasses and refrigerate for at least 4 hours or until set.Once the Panna Cotta has set, run a knife around the edge of each ramekin or glass to loosen the Panna Cotta."
        },
        {
            "name": "Gnocchi alla Sorrentina",
            "img": "https://i.ibb.co/9WnZWcm/Gnocchi-alla-Sorrentina.jpg",
            "ingredients": [
                "1 lb. of potato gnocchi",
                "2 cups of tomato sauce",
                "1 cup of diced fresh mozzarella cheese",
                "1/2 cup of grated Parmesan cheese",
                "2 tbsp. of olive oil",
                "1 garlic clove, minced",
                "Salt and pepper to taste",
                "Fresh basil leaves, chopped (optional)"
            ],
            "cooking_method": "Preheat your oven to 375°F.Cook the potato gnocchi in a large pot of boiling salted water for about 2-3 minutes, or until they float to the top.Drain the gnocchi and set them aside.In a large skillet, heat the olive oil over medium heat.Add the minced garlic to the skillet and sauté for about 30 seconds until fragrant.Add the tomato sauce to the skillet and season with salt and pepper to taste.Let the tomato sauce simmer for about 5-10 minutes.In a large baking dish, spread a thin layer of the tomato sauce on the bottom.Add the cooked gnocchi to the baking dish and toss them in the tomato sauce to coat.Top the gnocchi with the remaining tomato sauce."
        },
        {
            "name": "Bruschetta",
            "img": "https://i.ibb.co/b5pXhcb/Bruschetta.jpg",
            "ingredients": [
                "1 large French baguette, sliced into 1/2-inch thick slices",
                "3-4 ripe tomatoes, diced",
                "3 cloves of garlic, minced",
               " 1/4 cup of fresh basil leaves, chopped",
                "1/4 cup of extra-virgin olive oil",
                "Salt and pepper to taste"
            ],
            "cooking_method": "Preheat your oven to 375°F.Place the sliced baguette on a baking sheet and brush both sides with extra-virgin olive oil.Bake the baguette slices in the preheated oven for 8-10 minutes, or until lightly toasted and crisp.In a medium-sized bowl, combine the diced tomatoes, minced garlic, chopped basil leaves, and extra-virgin olive oil.Season the tomato mixture with salt and pepper to taste.Once the baguette slices are toasted, remove them from the oven and let them cool for a few minutes.Top each baguette slice with a spoonful of the tomato mixture.Serve the Bruschetta immediately and enjoy!"
        }
        
    ]
  },

  {
    "id": "vnbd48",
    "chefName": "Lidia Bastianich",
    "chefPictureUrl": "https://i.ibb.co/h74HNd7/cheff5.jpg",
    "Years_of_experience": "7 years",
    "Numbers_of_recipes": 3,
    "likes": 28527,
    "Ratings": 5,
    "description": "Lidia Bastianich is an Italian-American chef, author, and television personality who was born on February 21, 1947, in Pula, Istria (present-day Croatia). She is known for her expertise in Italian cuisine and her appearances on cooking shows.Bastianich's culinary career began when she and her family fled their home in Istria during World War II and settled in a refugee camp in Italy. She later moved to the United States with her family and began working in the food industry, eventually opening her first restaurant, 'Felidia,' in New York City in 1981.Over the years, Bastianich has become known for her dedication to preserving and promoting traditional Italian cuisine. She has authored several cookbooks, including 'Lidia's Family Table,' 'Lidia's Italian-American Kitchen,' and 'Lidia's Commonsense Italian Cooking,' which feature recipes inspired by her childhood in Istria and her experiences living in Italy and the United States. Bastianich has also hosted several cooking shows, including 'Lidia's Italy' and 'Lidia's Kitchen,' and has appeared as a judge on 'MasterChef' and 'MasterChef Junior.' In addition to her culinary work, Bastianich is involved in several charitable organizations, including the James Beard Foundation and the Mario Batali Foundation, which focuses on",
    "recipes": [
        {
            "name": "Saltimbocca alla Romana",
            "img": "https://i.ibb.co/12N2rMF/Saltimbocca-alla-Romana.jpg",
            "ingredients": [
                "4 veal cutlets, pounded thin",
                "4-8 thin slices of prosciutto",
                "4-8 fresh sage leaves",
                "1/2 cup of all-purpose flour",
                "1/4 cup of dry white wine",
                "1/4 cup of chicken broth",
                "2 tbsp. of unsalted butter",
                "2 tbsp. of olive oil",
                "Salt and pepper to taste"
            ],
            "cooking_method": "Season the veal cutlets with salt and pepper on both sides.Place a slice of prosciutto on top of each veal cutlet, and then place a fresh sage leaf on top of the prosciutto. Secure the sage leaf and prosciutto to the veal with a toothpick.Dredge the veal cutlets in the flour, shaking off any excess.In a large skillet, heat the olive oil and butter over medium heat.Add the veal cutlets to the skillet and cook them for about 2-3 minutes on each side, or until golden brown and cooked through.Remove the veal cutlets from the skillet and place them on a plate. Cover the plate with foil to keep the veal warm.In the same skillet, add the white wine and chicken broth. Bring the liquid to a simmer and scrape the browned bits off the bottom of the skillet with a wooden spoon.Let the liquid reduce by half, stirring occasionally.Remove the toothpicks from the veal cutlets and place them on a serving platter.Pour the reduced sauce over the veal cutlets."
        },
        {
            "name": "Caprese Salad",
            "img": "https://i.ibb.co/N26BTJ2/Caprese-Salad.jpg",
            "ingredients": [
                "2-3 ripe tomatoes, sliced",
                "8 oz. fresh mozzarella cheese, sliced",
                "1/4 cup of fresh basil leaves",
                "1/4 cup of extra-virgin olive oil",
                "2 tbsp. of balsamic vinegar",
                "Salt and pepper to taste"
            ],
            "cooking_method": "Arrange the sliced tomatoes and mozzarella cheese on a large platter, alternating them.Sprinkle salt and pepper over the tomato and mozzarella slices.Tear the fresh basil leaves and scatter them over the tomato and mozzarella slices.In a small bowl, whisk together the extra-virgin olive oil and balsamic vinegar.Drizzle the dressing over the Caprese Salad.Serve the Caprese Salad immediately and enjoy!"
        },
        {
            "name": "Bruschetta",
            "img": "https://i.ibb.co/b5pXhcb/Bruschetta.jpg",
            "ingredients": [
                "4 veal shanks, about 1-1/2 inches thick",
                "1/2 cup of all-purpose flour",
                "2 tbsp. of olive oil",
                "2 tbsp. of unsalted butter",
                "1 onion, finely chopped",
                "2 celery stalks, finely chopped",
                "2 carrots, finely chopped",
                "3 garlic cloves, minced",
                "1 can of crushed tomatoes (28 oz.)",
                "1 cup of chicken broth"
            ],
            "cooking_method": "Preheat the oven to 350°F.Season the veal shanks with salt and pepper on both sides.Dredge the veal shanks in the flour, shaking off any excess.In a large Dutch oven or oven-safe pot, heat the olive oil and butter over medium heat.Add the veal shanks to the pot and cook them for about 4-5 minutes on each side, or until browned.Remove the veal shanks from the pot and place them on a plate. Cover the plate with foil to keep the veal warm.In the same pot, add the onion, celery, carrots, and garlic. Cook the vegetables for about 5-6 minutes, or until softened.Add the crushed tomatoes, chicken broth, dry white wine, tomato paste, and bay leaf to the pot. Stir to combine.Return the veal shanks to the pot, submerging them in the tomato sauce."
        }
        
    ]
  },

  {
    "id": "254h1ty4",
    "chefName": "Mario Batali",
    "chefPictureUrl": "https://i.ibb.co/YPzYmPV/cheff6.jpg",
    "Years_of_experience": "9 years",
    "Numbers_of_recipes": 3,
    "likes": 11425,
    "Ratings": 4.7,
    "description": "Mario Batali is an American chef, restaurateur, author, and media personality who was born on September 19, 1960, in Seattle, Washington. He is known for his expertise in Italian cuisine and his appearances on cooking shows.Batali's culinary career began when he attended Le Cordon Bleu in London, England. He later worked in several restaurants in California before opening his own restaurant, 'Pó,' in New York City in 1993.Over the years, Batali has become known for his dedication to promoting authentic Italian cuisine and his use of local and seasonal ingredients in his cooking. He has authored several cookbooks, including 'Molto Italiano,' 'Mario Batali Holiday Food,' and 'Mario Batali - Big American Cookbook,' which feature recipes inspired by his travels throughout Italy and the United States. Batali has also hosted several cooking shows, including 'Molto Mario' and 'Iron Chef America,' and has appeared as a judge on 'Top Chef' and 'MasterChef.' In addition to his culinary work, Batali is involved in several charitable organizations, including the Mario Batali Foundation, which focuses on pediatric disease research and education. He is also a passionate advocate for sustainable agriculture and has worked to promote the use of locally sourced and organic ingredients in the restaurant industry.",
    "recipes": [
        {
            "name": "Risotto ai Funghi ",
            "img": "https://i.ibb.co/HB1mM5D/Risotto-ai-Funghi.jpg",
            "ingredients": [
                "1-1/2 cups of Arborio rice",
                "4 cups of chicken broth",
                "1/2 cup of dry white wine",
                "1/2 cup of grated Parmesan cheese",
                "2 tbsp. of unsalted butter",
                "2 tbsp. of olive oil",
                "1 onion, finely chopped",
                "3 garlic cloves, minced",
                "8 oz. of fresh mushrooms, sliced",
                "Salt and pepper to taste"
            ],
            "cooking_method": "In a large saucepan, heat the chicken broth over medium heat.In a separate pot, heat the olive oil and butter over medium heat.Add the onion and garlic to the pot and cook for about 2-3 minutes, or until softened.Add the sliced mushrooms to the pot and cook for about 5-6 minutes, or until the mushrooms are tender and browned.Remove the mushrooms from the pot and set them aside on a plate.In the same pot, add the Arborio rice and stir it to coat with the oil and butter. Cook the rice for about 2-3 minutes, or until it becomes translucent.Add the dry white wine to the pot and stir until the wine is absorbed by the rice.Ladle the hot chicken broth into the pot, one cup at a time, stirring constantly until each cup is absorbed by the rice. Repeat this process until the rice is cooked al dente, which should take about 20-25 minutes.Add the cooked mushrooms and grated Parmesan cheese to the pot, stirring to combine."
        },
        {
            "name": "Gnocchi alla Sorrentina",
            "img": "https://i.ibb.co/9WnZWcm/Gnocchi-alla-Sorrentina.jpg",
            "ingredients": [
                "1 lb. of potato gnocchi",
                "2 cups of tomato sauce",
                "1 cup of diced fresh mozzarella cheese",
                "1/2 cup of grated Parmesan cheese",
                "2 tbsp. of olive oil",
                "1 garlic clove, minced",
                "Salt and pepper to taste",
                "Fresh basil leaves, chopped (optional)"
            ],
            "cooking_method": "Preheat your oven to 375°F.Cook the potato gnocchi in a large pot of boiling salted water for about 2-3 minutes, or until they float to the top.Drain the gnocchi and set them aside.In a large skillet, heat the olive oil over medium heat.Add the minced garlic to the skillet and sauté for about 30 seconds until fragrant.Add the tomato sauce to the skillet and season with salt and pepper to taste.Let the tomato sauce simmer for about 5-10 minutes.In a large baking dish, spread a thin layer of the tomato sauce on the bottom.Add the cooked gnocchi to the baking dish and toss them in the tomato sauce to coat.Top the gnocchi with the remaining tomato sauce."
        },
        {
            "name": "Saltimbocca alla Romana",
            "img": "https://i.ibb.co/12N2rMF/Saltimbocca-alla-Romana.jpg",
            "ingredients": [
                "4 veal cutlets, pounded thin",
                "4-8 thin slices of prosciutto",
                "4-8 fresh sage leaves",
                "1/2 cup of all-purpose flour",
                "1/4 cup of dry white wine",
                "1/4 cup of chicken broth",
                "2 tbsp. of unsalted butter",
                "2 tbsp. of olive oil",
                "Salt and pepper to taste"
            ],
            "cooking_method": "Season the veal cutlets with salt and pepper on both sides.Place a slice of prosciutto on top of each veal cutlet, and then place a fresh sage leaf on top of the prosciutto. Secure the sage leaf and prosciutto to the veal with a toothpick.Dredge the veal cutlets in the flour, shaking off any excess.In a large skillet, heat the olive oil and butter over medium heat.Add the veal cutlets to the skillet and cook them for about 2-3 minutes on each side, or until golden brown and cooked through.Remove the veal cutlets from the skillet and place them on a plate. Cover the plate with foil to keep the veal warm.In the same skillet, add the white wine and chicken broth. Bring the liquid to a simmer and scrape the browned bits off the bottom of the skillet with a wooden spoon.Let the liquid reduce by half, stirring occasionally.Remove the toothpicks from the veal cutlets and place them on a serving platter.Pour the reduced sauce over the veal cutlets."
        } 
    ]
  }

]

